from math import floor
import matplotlib.pyplot as plt
import numpy as np

# 原始数据

Tokyo_Low = np.array([
    [0.3772048846675711, 2.8290366350067835, 826.1635685210313, 0.0],
    [0.39294436906377195, 2.9470827679782894, 860.6365807327002, 0.0],
    [0.3772048846675711, 2.8290366350067835, 2334.9831071913163, 0.0],
    [0.39294436906377195, 2.9470827679782894, 2432.4140569877886, 0.0],
    [0.3772048846675711, 2.8290366350067835, 4598.212415196745, 0.0],
    [0.39294436906377195, 2.9470827679782894, 4790.0802713704215, 0.0]
])

Tokyo_Medium = np.array([
    [0.4047942107643599, 3.0359565807326994, 886.5904002713704, 0.0],
    [0.41085481682496594, 3.0814111261872448, 899.8644911804613, 0.0],
    [0.4047942107643599, 3.0359565807326994, 2505.7672433288108, 0.0],
    [0.41085481682496594, 3.0814111261872448, 2543.283758480326, 0.0],
    [0.4047942107643599, 3.0359565807326994, 4934.532507914971, 0.0],
    [0.41085481682496594, 3.0814111261872448, 5008.412659430122, 0.0]
])

Tokyo_High = np.array([
    [0.5798281320669376, 4.348710990502035, 1269.9540705563093, 0.0],
    [0.5919493441881498, 4.4396200814111255, 1296.502252374491, 0.0],
    [0.5798281320669376, 4.348710990502035, 3589.2665988240624, 0.0],
    [0.5919493441881498, 4.4396200814111255, 3664.299629127092, 0.0],
    [0.5798281320669376, 4.348710990502035, 7068.23539122569, 0.0],
    [0.5919493441881498, 4.4396200814111255, 7215.995694255994, 0.0]
])
Large_Low = np.array([[0.22753623188405805, 1.706521739130435, 498.3555434782611, 0.0],
                      [0.24057971014492763, 1.804347826086957, 526.9236956521743, 0.0],
                      [0.22753623188405805, 1.706521739130435, 1408.5004710144935, 0.0],
                      [0.24057971014492763, 1.804347826086957, 1489.2425362318852, 0.0],
                      [0.22753623188405805, 1.706521739130435, 2773.717862318842, 0.0],
                      [0.24057971014492763, 1.804347826086957, 2932.7207971014514, 0.0]])
Large_Medium = np.array([[0.263768115942029, 1.978260869565218, 577.7115217391308, 0.0],
                         [0.26811594202898553, 2.0108695652173916, 587.2342391304353, 0.0],
                         [0.263768115942029, 1.978260869565218, 1632.7839855072477, 0.0],
                         [0.26811594202898553, 2.0108695652173916, 1659.6980072463784, 0.0],
                         [0.263768115942029, 1.978260869565218, 3215.3926811594224, 0.0],
                         [0.26811594202898553, 2.0108695652173916, 3268.393659420293, 0.0]])
Large_High = np.array([[0.4884057971014486, 3.66304347826087, 1069.7185869565217, 0.0],
                       [0.5188405797101442, 3.8913043478260874, 1136.3776086956518, 0.0],
                       [0.4884057971014486, 3.66304347826087, 3023.3417753623185, 0.0],
                       [0.5188405797101442, 3.8913043478260874, 3211.7399275362313, 0.0],
                       [0.4884057971014486, 3.66304347826087, 5953.776557971013, 0.0],
                       [0.5188405797101442, 3.8913043478260874, 6324.7834057971, 0.0]])

# 数据准备
data_list = [[Tokyo_Low, Tokyo_Medium, Tokyo_High], [Large_Low, Large_Medium, Large_High]]
Subplot_list = ['Tokyo', 'NSF']

colors = [
        '#8DB255', '#8DB255',
        '#5C8EA3', '#5C8EA3',
        '#C43E3E', '#C43E3E',
        '#8DB255', '#8DB255',
        '#5C8EA3', '#5C8EA3',
        '#C43E3E', '#C43E3E',
        '#8DB255', '#8DB255',
        '#C43E3E', '#C43E3E'
]

fig, axes = plt.subplots(1, 2, figsize=(16, 4), sharey=False)


for ax_idx, ax in enumerate(axes):
    groups = data_list[ax_idx]
    x_positions = []
    current_x = 0
    group_centers = []  # 记录每组的中点
    Traffic_list = ['Low', 'Medium', 'High']
    cases = [
        r'$\tau_{dsp}=5\times10^{-5}$, B',
        r'$\tau_{dsp}=5\times10^{-5}$, NB',
        r'$\tau_{dsp}=1.5\times10^{-4}$, B',
        r'$\tau_{dsp}=1.5\times10^{-4}$, NB',
        r'$\tau_{dsp}=3\times10^{-4}$, B',
        r'$\tau_{dsp}=3\times10^{-4}$, NB'
    ]

    for i, group in enumerate(groups):
        num_bars = group.shape[0]
        xs = np.arange(num_bars) + current_x
        x_positions.extend(xs)
        # 保存每组的中点
        group_centers.append(np.mean(xs))
        # 画每根柱子
        for j in range(num_bars):
            height = np.sum(group[j, :])
            if j % 2 == 0:
                ax.bar(xs[j], height, width=0.8, color=colors[floor(j)],
                       label=cases[j] if (i == 0 and ax_idx == 0) else "")
            else:
                ax.bar(xs[j], height, width=0.8, color=colors[floor(j)],
                       label=cases[j] if (i == 0 and ax_idx == 0) else "", hatch='///')
        current_x = xs[-1] + 2  # 每组之间空两格

    # ax.set_title(f"{Subplot_list[ax_idx]}", fontsize=20)
    ax.set_xlabel(f'Traffic Level of {Subplot_list[ax_idx]}', fontsize=20)
    ax.set_ylabel('Average Power', fontsize=20)
    ax.set_xticks(group_centers)
    ax.set_xticklabels(Traffic_list, fontsize=18)
    ax.tick_params(axis='y', labelsize=18)
    ax.tick_params(axis='x', labelsize=16)
    ax.grid(True, axis='y', linestyle='--', alpha=0.6)

    if ax_idx == 0:
        ax.set_ylim(0, 7500)

# 1. 先 tight_layout，不画legend
fig.tight_layout()

# 2. 手动往下压子图，留出上面的空间
plt.subplots_adjust(top=0.85)  # 注意: top=0.75 让子图只占75%，上方留25%空间

# 3. 再画 legend（放在 figure 的上方）
handles, labels = axes[0].get_legend_handles_labels()
by_label = dict(zip(labels, handles))
fig.legend(by_label.values(), by_label.keys(),
           loc='upper center',
           bbox_to_anchor=(0.5, 1),
           ncol=6,
           fontsize=15,
           columnspacing=0.2)  # 默认是 2.0，可以调小

# 4. 显示
plt.show()